In [2]:
import pandas as pd
import numpy as np

In [3]:
TitanicData = pd.read_csv("train.csv")

In [4]:
TitanicData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
TitanicData.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [6]:
TitanicData.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
remove_cols = ['Cabin',"PassengerId","Ticket","Name","Fare"]

In [8]:
TitanicData.drop(columns=remove_cols,axis=1,inplace=True)

In [9]:
TitanicData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 7 columns):
Survived    889 non-null int64
Pclass      889 non-null int64
Sex         889 non-null object
Age         889 non-null float64
SibSp       889 non-null int64
Parch       889 non-null int64
Embarked    889 non-null object
dtypes: float64(1), int64(4), object(2)
memory usage: 41.7+ KB

In [10]:
TitanicData.drop_duplicates()

     Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0           0       3    male  22.0      1      0        S
1           1       1  female  38.0      1      0        C
2           1       3  female  26.0      0      0        S
3           1       1  female  35.0      1      0        S
4           0       3    male  35.0      0      0        S
..        ...     ...     ...   ...    ...    ...      ...
883         0       3  female  39.0      0      5        Q
885         1       1  female  19.0      0      0        S
886         0       3  female  45.0      1      2        S
887         1       1    male  26.0      0      0        C
888         0       3    male  32.0      0      0        Q

[577 rows x 7 columns]

In [11]:
TitanicData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 7 columns):
Survived    889 non-null int64
Pclass      889 non-null int64
Sex         889 non-null object
Age         889 non-null float64
SibSp       889 non-null int64
Parch       889 non-null int64
Embarked    889 non-null object
dtypes: float64(1), int64(4), object(2)
memory usage: 41.7+ KB

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
from sklearn import preprocessing

In [14]:
le = preprocessing.LabelEncoder()

In [15]:
TitanicData['Sex'] = le.fit_transform(TitanicData['Sex'] )

In [16]:
TitanicData['Embarked'] = le.fit_transform(TitanicData['Embarked'] )

In [17]:
TitanicData.Age = np.round(TitanicData.Age).astype('int')

In [18]:
TitanicData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 7 columns):
Survived    889 non-null int64
Pclass      889 non-null int64
Sex         889 non-null int32
Age         889 non-null int32
SibSp       889 non-null int64
Parch       889 non-null int64
Embarked    889 non-null int32
dtypes: int32(3), int64(4)
memory usage: 38.3 KB

In [19]:
TitanicData.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0         0       3    1   22      1      0         2
1         1       1    0   38      1      0         0
2         1       3    0   26      0      0         2
3         1       1    0   35      1      0         2
4         0       3    1   35      0      0         2

In [20]:
y = TitanicData['Sex']

In [21]:
Features = ['Pclass','Sex','Age','SibSp','Parch','Embarked']

In [22]:
X = TitanicData[Features]

In [23]:
X

     Pclass  Sex  Age  SibSp  Parch  Embarked
0         3    1   22      1      0         2
1         1    0   38      1      0         0
2         3    0   26      0      0         2
3         1    0   35      1      0         2
4         3    1   35      0      0         2
..      ...  ...  ...    ...    ...       ...
884       2    1   27      0      0         2
885       1    0   19      0      0         2
886       3    0   45      1      2         2
887       1    1   26      0      0         0
888       3    1   32      0      0         1

[889 rows x 6 columns]

In [24]:
x_train,x_test,y_train,y_test = train_test_split(X,y,test_size =0.25,random_state=1)

In [25]:
x_train.shape

(666, 6)

In [26]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [27]:
from sklearn import neighbors

In [45]:
knn = neighbors.KNeighborsClassifier(n_neighbors=4)

In [46]:
knn.fit(x_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=4, p=2,
                     weights='uniform')

In [47]:
YPred= knn.predict(x_test)

In [48]:
accuracy_score(y_test,YPred,normalize =True)

0.8385650224215246

In [32]:
confusion_matrix(y_test,YPred)

array([[ 58,  22],
       [ 17, 126]], dtype=int64)